package com.example.finals;

import java.util.HashMap;
import java.util.Map;

public class Hashmap {

    Map<String, String> data = new HashMap<>();

    public Hashmap(){
        data = new HashMap<>();
    }

    String[] Top40 = {"삼성전자", "SK하이닉스", "삼성전자우", "삼성바이오로직스", "NAVER", "현대차", "LG화학",
            "셀트리온", "삼성SDI", "삼성물산", "현대모비스", "LG생활건강", "POSCO", "SK텔레콤", "신한지주", "KB금융",
            "SK", "기아차", "한국전력", "삼성에스디에스", "카카오", "엔씨소프트", "삼성생명", "LG", "아모레퍼시픽", "하나금융지주",
            "삼성화재", "삼성전기", "S-Oil", "한국조선해양", "고려아연", "KODEX200", "넷마블", "우리금융지주", "롯데케미칼",
            "웅진코웨이", "KT", "KT&G", "SK이노베이션", "LG전자", "기업은행", "LG유플러스", "강원랜드", "LG디스플레이", "한온시스템",
            "아모레G", "현대글로비스", "현대중공업지주", "미래에셋대우", "현대건설"};

    String[] Code = {"005930", "000660", "005935", "207940", "035420", "005380", "051910", "068270", "006400",
            "028260", "012330", "051900", "005490", "017670", "055550", "105560", "034730", "000270", "015760", "018260",
            "035720", "036570", "032830", "003550", "090430", "086790", "000810", "009150", "010950", "009540", "010130",
            "069500", "251270", "316140", "011170", "021240", "030200", "033780", "096770", "066570", "024110", "032640",
            "035250", "034220", "018880", "002790", "086280", "267250", "006800", "000720"};


    public int putValue(){

        for(int i=0; i<50; i++){
            data.put(Top40[i], Code[i]);
        }
        return 0;
    }

    public String[] getKey(){
        return Top40;
    }


    public String getValue(String a){
        return data.get(a);
    }

}
